schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
// ALL STATE
displayHeader dispHeader("dispHeader", _fonts[1]);
displayFooter dispFooter("dispFooter", _fonts[1]);
// RADIO
button2state  btn_RA_Mute("btn_RA_Mute");
button1state  btn_RA_volDown("btn_RA_volDown"), btn_RA_volUp("btn_RA_volUp"), btn_RA_prevSta("btn_RA_prevSta"), btn_RA_nextSta("btn_RA_nextSta");
button1state  btn_RA_staList("btn_RA_staList"), btn_RA_player("btn_RA_player"), btn_RA_dlna("btn_RA_dlna"), btn_RA_clock("btn_RA_clock");
button1state  btn_RA_sleep("btn_RA_sleep"), btn_RA_bright("btn_RA_bright"), btn_RA_equal("btn_RA_equal"), btn_RA_bt("btn_RA_bt");
button1state  btn_RA_off("btn_RA_off");
pictureBox    pic_RA_logo("pic_RA_logo");
textbox       txt_RA_sTitle("txt_RA_sTitle"), txt_RA_staName("txt_RA_staName"), txt_RA_irNum("txt_RA_irNum");
vuMeter       VUmeter_RA("VUmeter_RA");
// STATIONSLIST
stationsList  lst_RADIO("lst_RADIO");
// PLAYER
button2state  btn_PL_Mute("btn_PL_Mute"), btn_PL_pause("btn_PL_pause");
button1state  btn_PL_volDown("btn_PL_volDown"), btn_PL_volUp("btn_PL_volUp"), btn_PL_ready("btn_PL_ready"), btn_PL_shuffle("btn_PL_shuffle");
button1state  btn_PL_playAll("btn_PL_playAll"), btn_PL_fileList("btn_PL_fileList"), btn_PL_radio("btn_PL_radio"), btn_PL_cancel("btn_PL_cancel");
button1state  btn_PL_prevFile("btn_PL_prevFile"), btn_PL_nextFile("btn_PL_nextFile");
textbox       txt_PL_fName("txt_PL_fName");
// AUDIOFILESLIST
fileList      lst_PLAYER("lst_PLAYER");
// DLNA
button2state  btn_DL_Mute("btn_DL_Mute"), btn_DL_pause("btn_DL_pause");
button1state  btn_DL_volDown("btn_DL_volDown"), btn_DL_volUp("btn_DL_volUp");
button1state  btn_DL_radio("btn_DL_radio"), btn_DL_fileList("btn_DL_fileList"), btn_DL_cancel("btn_DL_cancel");
textbox       txt_DL_fName("txt_DL_fName");
// DLNAITEMSLIST
dlnaList      lst_DLNA("lst_DLNA", &dlna, &_dlnaHistory[0], 10);
// CLOCK
imgClock      clk_CL_green("clk_CL_green");
button2state  btn_CL_Mute("btn_CL_Mute");
button1state  btn_CL_alarm("btn_CL_alarm"), btn_CL_radio("btn_CL_radio"), btn_CL_volDown("btn_CL_volDown"), btn_CL_volUp("btn_CL_volUp");
// ALARM
alarmClock    clk_AL_red("clk_CL_green");
button1state  btn_AL_left("btn_AL_left"), btn_AL_right("btn_AL_right"), btn_AL_up("btn_AL_up"), btn_AL_down("btn_AL_down");
button1state  btn_AL_ready("btn_AL_ready");
// BRIGHTNESS
button1state  btn_BR_left("btn_BR_left"), btn_BR_right("btn_BR_right"), btn_BR_ready("btn_BR_ready");
pictureBox    pic_BR_logo("pic_BR_logo");
// SLEEP
button1state  btn_SL_up("btn_SL_up"), btn_SL_down("btn_SL_down"), btn_SL_ready("btn_SL_ready"), btn_SL_cancel("btn_SL_cancel");
// EQUALIZER
slider        sdr_EQ_lowPass("sdr_E_LP"), sdr_EQ_bandPass("sdr_E_BP"), sdr_EQ_highPass("sdr_E_HP"), sdr_EQ_balance("sdr_E_BAL");
textbox       txt_EQ_lowPass("txt_E_LP"), txt_EQ_bandPass("txt_E_BP"), txt_EQ_highPass("txt_E_HP"), txt_EQ_balance("txt_E_BAL");
button1state  btn_EQ_lowPass("btn_E_LP");
button1state  btn_EQ_bandPass("btn_E_BP"), btn_EQ_highPass("btn_E_HP"), btn_EQ_balance("btn_E_BAL");
button1state  btn_EQ_Radio("btn_EQ_Radio"), btn_EQ_Player("btn_EQ_Player");
button2state  btn_EQ_Mute("btn_EQ_Mute");
// BLUETOOTH
button2state  btn_BT_pause("btn_BT_pause"), btn_BT_power("btn_BT_power");
button1state  btn_BT_volDown("btn_BT_volDown"), btn_BT_volUp("btn_BT_volUp"), btn_BT_radio("btn_BT_radio"), btn_BT_mode("btn_BT_mode");
pictureBox    pic_BT_mode("pic_BT_mode");
textbox       txt_BT_mode("txt_BT_mode");
textbox       txt_BT_volume("txt_BT_volume");

/*  ╔═══════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╗
    ║                                                     D E F A U L T S E T T I N G S                                                         ║
    ╚═══════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╝   */

// clang-format off
boolean defaultsettings(){
    if(!SD_MMC.exists("/settings.json")){
        File file = SD_MMC.open("/settings.json","w", true);
        char*  jO = x_ps_malloc(1024); // JSON Object
        strcpy(jO, "{");
        strcat(jO, "\"volume\":");            strcat(jO, "12,"); // 0...21
        strcat(jO, "\"BTvolume\":");          strcat(jO, "16,"); // 0...31
        strcat(jO, "\"BTpower\":");           strcat(jO, "\"false\","); // assume KCX_BT_Emitter not exists or is off
        strcat(jO, "\"ringvolume\":");        strcat(jO, "21,");
        strcat(jO, "\"alarmtime_sun\":");     strcat(jO, "00:00,");
        strcat(jO, "\"alarmtime_mon\":");     strcat(jO, "00:00,");
        strcat(jO, "\"alarmtime_tue\":");     strcat(jO, "00:00,");
        strcat(jO, "\"alarmtime_wed\":");     strcat(jO, "00:00,");
        strcat(jO, "\"alarmtime_fri\":");     strcat(jO, "00:00,");
        strcat(jO, "\"alarmtime_sat\":");     strcat(jO, "00:00,");
        strcat(jO, "\"alarm_weekdays\":");    strcat(jO, "0,");
        strcat(jO, "\"timeAnnouncing\":");    strcat(jO, "\"true\",");
        strcat(jO, "\"mute\":");              strcat(jO, "\"false\","); // no mute
        strcat(jO, "\"brightness\":");        strcat(jO, "100,");  // 0...100
        strcat(jO, "\"sleeptime\":");         strcat(jO, "0,");
        strcat(jO, "\"lastconnectedhost\":"); strcat(jO, "\"\",");
        strcat(jO, "\"station\":");           strcat(jO, "1,");
        strcat(jO, "\"sumstations\":");       strcat(jO, "0,");
        strcat(jO, "\"Timezone_Name\":");     strcat(jO, "\"Europe/Berlin\",");
        strcat(jO, "\"Timezone_String\":");   strcat(jO, "\"CET-1CEST,M3.5.0,M10.5.0/3\",");
        strcat(jO, "\"toneLP\":");            strcat(jO, "0,"); // -40 ... +6 (dB)        audioI2S
        strcat(jO, "\"toneBP\":");            strcat(jO, "0,"); // -40 ... +6 (dB)        audioI2S
        strcat(jO, "\"toneHP\":");            strcat(jO, "0,"); // -40 ... +6 (dB)        audioI2S
        strcat(jO, "\"balance\":");           strcat(jO, "0,"); // -16 ... +16            audioI2S
        strcat(jO, "\"timeFormat\":");        strcat(jO, "24,");
        strcat(jO, "\"sleepMode\":");         strcat(jO, "0,"); // 0 display off, 1 clock
        strcat(jO, "\"alarmMode\":");         strcat(jO, "1}"); // 0 with radio only, 1 with bell and radio
        file.print(jO);
        if(jO){free(jO); jO = NULL;}
    }

    File file = SD_MMC.open("/settings.json","r", false);
    char*  jO = x_ps_calloc(1024, 1);
    char* tmp = x_ps_malloc(512);
    file.readBytes(jO, 1024);
    _settingsHash = simpleHash(jO);

    auto parseJson = [&](const char* s) { // lambda, inner function
        int16_t pos1 = 0, pos2 = 0, pos3 = 0;
        pos1 = indexOf(jO, s, 0);
        pos2 = indexOf(jO, ":", pos1) + 1;
        pos3 = indexOf(jO, ",\"", pos2);
        if(pos3 < 0) pos3 = indexOf(jO, "}", pos2);
        if(pos1 < 0) {log_e("index %s not found", s); return "";}
        if(jO[pos2] == '\"'){pos2++; pos3--;}  // remove \" embraced strings
        strncpy(tmp, jO + pos2, pos3 - pos2);
        tmp[pos3 - pos2] = '\0';
        return (const char*)tmp;
    };

    auto computeMinuteOfTheDay = [&](const char* s){
        if(!s) return 0;
        int h = atoi(s);
        int m = atoi(s + 3);
        return h * 60 + m;
    };

    _cur_volume          = atoi(   parseJson("\"volume\":"));
    _BTvolume            = atoi(   parseJson("\"BTvolume\":"));
    _f_BTpower           = (strcmp(parseJson("\"BTpower\":"), "true") == 0) ? 1 : 0;
    _ringvolume          = atoi(   parseJson("\"ringvolume\":"));
    _alarmtime[0]        = computeMinuteOfTheDay(parseJson("\"alarmtime_sun\":"));
    _alarmtime[1]        = computeMinuteOfTheDay(parseJson("\"alarmtime_mon\":"));
    _alarmtime[2]        = computeMinuteOfTheDay(parseJson("\"alarmtime_tue\":"));
    _alarmtime[3]        = computeMinuteOfTheDay(parseJson("\"alarmtime_wed\":"));
    _alarmtime[4]        = computeMinuteOfTheDay(parseJson("\"alarmtime_thu\":"));
    _alarmtime[5]        = computeMinuteOfTheDay(parseJson("\"alarmtime_fri\":"));
    _alarmtime[6]        = computeMinuteOfTheDay(parseJson("\"alarmtime_sat\":"));
    _alarmdays           = atoi(   parseJson("\"alarm_weekdays\":"));
    _f_timeAnnouncement  = (strcmp(parseJson("\"timeAnnouncing\":"), "true") == 0) ? 1 : 0;
    _f_mute              = (strcmp(parseJson("\"mute\":"), "true") == 0) ? 1 : 0;
    _brightness          = atoi(   parseJson("\"brightness\":"));
    _sleeptime           = atoi(   parseJson("\"sleeptime\":"));
    _cur_station         = atoi(   parseJson("\"station\":"));
    _sum_stations        = atoi(   parseJson("\"sumstations\":"));
    _toneLP              = atoi(   parseJson("\"toneLP\":"));
    _toneBP              = atoi(   parseJson("\"toneBP\":"));
    _toneHP              = atoi(   parseJson("\"toneHP\":"));
    _toneBAL             = atoi(   parseJson("\"balance\":"));
    _timeFormat          = atoi(   parseJson("\"timeFormat\":"));
    _TZName              =         parseJson("\"Timezone_Name\":");
    _TZString            =         parseJson("\"Timezone_String\":");
    _lastconnectedhost   =         parseJson("\"lastconnectedhost\":");
    _sleepMode           = atoi(   parseJson("\"sleepMode\":"));
    _alarmMode           = atoi(   parseJson("\"alarmMode\":"));


    if(!pref.isKey("stations_filled")|| _sum_stations == 0) saveStationsToNVS();  // first init
    if(pref.getShort("IR_numButtons", 0) == 0) saveDefaultIRbuttonsToNVS();
    loadIRbuttonsFromNVS();

    if(jO) {free(jO);   jO = NULL;}
    if(tmp){free(tmp); tmp = NULL;}
    return true;
}
// clang-format on

boolean saveStationsToNVS() {
    String   Hide = "", Cy = "", StationName = "", StreamURL = "", currentLine = "", tmp = "";
    uint16_t cnt = 0;
    // StationList
    if(!SD_MMC.exists("/stations.csv")) {
        SerialPrintfln(ANSI_ESC_RED "SD_MMC/stations.csv not found");
        return false;
    }

