schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
}
// clang-format on

/*****************************************************************************************************************************************************
 *                                                               D I S P L A Y                                                                       *
 *****************************************************************************************************************************************************/

// clang-format off
inline void clearHeader()             {tft.fillRect(_winHeader.x,    _winHeader.y,    _winHeader.w,    _winHeader.h,   TFT_BLACK);}
inline void clearLogo()               {tft.fillRect(_winLogo.x,      _winLogo.y,      _winLogo.w,      _winLogo.h,     TFT_BLACK);}
inline void clearStationName()        {tft.fillRect(_winName.x,      _winName.y,      _winName.w,      _winName.h,     TFT_BLACK);}
inline void clearLogoAndStationname() {tft.fillRect(_winFName.x,     _winFName.y,     _winFName.w,     _winFName.h,    TFT_BLACK);}
inline void clearTitle()              {tft.fillRect(_winTitle.x,     _winTitle.y,     _winTitle.w,     _winTitle.h,    TFT_BLACK);} // incl. VUmeter
inline void clearStreamTitle()        {tft.fillRect(_winSTitle.x,    _winSTitle.y,    _winSTitle.w,    _winSTitle.h,   TFT_BLACK);} // without VUmeter
inline void clearWithOutHeaderFooter(){tft.fillRect(_winWoHF.x,      _winWoHF.y,      _winWoHF.w,      _winWoHF.h,     TFT_BLACK);}
inline void clearFooter()             {tft.fillRect(_winFooter.x,    _winFooter.y,    _winFooter.w,    _winFooter.h,   TFT_BLACK);}
inline void clearStaNr()              {tft.fillRect(_winStaNr.x,     _winStaNr.y,     _winStaNr.w,     _winStaNr.h,    TFT_BLACK);}
inline void clearSleep()              {tft.fillRect(_winSleep.x,     _winSleep.y,     _winSleep.w,     _winSleep.h,    TFT_BLACK);}
inline void clearVolBar()             {tft.fillRect(_winVolBar.x,    _winVolBar.y,    _winVolBar.w,    _winVolBar.h,   TFT_BLACK);}
inline void clearDigits()             {tft.fillRect(_winDigits.x,    _winDigits.y,    _winDigits.w,    _winDigits.h,   TFT_BLACK);}
inline void clearButtonBar()          {tft.fillRect( 0,              _winButton.y,    _dispWidth,      _winButton.h,   TFT_BLACK);}
inline void clearAll()                {tft.fillScreen(TFT_BLACK);}                      // y   0...239
// clang-format on

inline uint16_t txtlen(String str) {
    uint16_t len = 0;
    for(int32_t i = 0; i < str.length(); i++)
        if(str[i] <= 0xC2) len++;
    return len;
}

void showVolumeBar() {
    uint16_t val = tft.width() * _cur_volume / 21;
    clearVolBar();
    tft.fillRect(_winVolBar.x, _winVolBar.y + 1, val, _winVolBar.h - 2, TFT_RED);
    tft.fillRect(val + 1, _winVolBar.y + 1, tft.width() - val + 1, _winVolBar.h - 2, TFT_GREEN);
    _f_volBarVisible = true;
}

void showBrightnessBar() {
    uint16_t val = tft.width() * getBrightness() / 100;
    clearVolBar();
    tft.fillRect(_winVolBar.x, _winVolBar.y + 1, val, _winVolBar.h - 2, TFT_RED);
    tft.fillRect(val + 1, _winVolBar.y + 1, tft.width() - val + 1, _winVolBar.h - 2, TFT_GREEN);
    _f_volBarVisible = true;
}

void display_info(const char* str, int32_t xPos, int32_t yPos, uint16_t color, uint16_t margin_l, uint16_t margin_r, uint16_t winWidth, uint16_t winHeight) {
    tft.fillRect(xPos, yPos, winWidth, winHeight, TFT_BLACK); // Clear the space for new info
    tft.setTextColor(color);                                  // Set the requested color
    uint16_t ch_written = tft.writeText(str, xPos + margin_l, yPos, winWidth - margin_r, winHeight);
    if(ch_written < strlenUTF8(str)) {
        // If this message appears, there is not enough space on the display to write the entire text,
        // a part of the text has been cut off
        SerialPrintfln("txt overflow, winHeight=" ANSI_ESC_CYAN "%d" ANSI_ESC_WHITE ", strlen=" ANSI_ESC_CYAN "%d" ANSI_ESC_WHITE ", written=" ANSI_ESC_CYAN "%d" ANSI_ESC_WHITE ", str=" ANSI_ESC_CYAN
                       "%s",
                       winHeight, strlenUTF8(str), ch_written, str);
    }
}

void showStreamTitle(const char* streamtitle) {
    if(_f_sleeping) return;

    char* st = x_ps_strdup(streamtitle);
    trim(st);
    replacestr(st, " | ", "\n"); // some stations use pipe as \n or
    replacestr(st, "| ", "\n");
    replacestr(st, "|", "\n");

    txt_RA_sTitle.setTextColor(TFT_CORNSILK);
    txt_RA_sTitle.writeText(st, TFT_ALIGN_LEFT, TFT_ALIGN_CENTER);

    if(st){free(st); st = NULL;}
}

void showLogoAndStationName(bool force) {
    char* SN_utf8 = NULL;
    static char* old_SN_utf8 = strdup("");
    if(force){
        if(old_SN_utf8){free(old_SN_utf8); old_SN_utf8 = strdup("");}
    }

    if(_cur_station) {
        SN_utf8 = x_ps_calloc(_stationName_nvs.length() + 12, 1);
        memcpy(SN_utf8, _stationName_nvs.c_str(), _stationName_nvs.length() + 1);
    }
    else {
        if(!_stationName_air) _stationName_air = strdup("");
        SN_utf8 = x_ps_calloc(strlen(_stationName_air) + 12, 1);
        memcpy(SN_utf8, _stationName_air,  strlen(_stationName_air) + 1);
    }
    trim(SN_utf8);
    if(strcmp(old_SN_utf8, SN_utf8) == 0) {goto exit;}
    if(old_SN_utf8){free(old_SN_utf8); old_SN_utf8 = NULL;}
    old_SN_utf8 = x_ps_strdup(SN_utf8);
    txt_RA_staName.setTextColor(TFT_CYAN);
    txt_RA_staName.writeText(SN_utf8, TFT_ALIGN_LEFT, TFT_ALIGN_TOP);

    memmove(SN_utf8  + 6, SN_utf8, strlen(SN_utf8) + 1);
    memmove(SN_utf8, "/logo/", 6);
    strcat(SN_utf8, ".jpg");
    pic_RA_logo.setPicturePath(SN_utf8);
    pic_RA_logo.setAlternativPicturePath("/common/unknown.jpg");
    pic_RA_logo.show();
exit:
    if(SN_utf8){free(SN_utf8); SN_utf8 = NULL;}
}

void showFileLogo(uint8_t state) {
    xSemaphoreTake(mutex_display, portMAX_DELAY);
    String logo;
    if(state == RADIO) {
        if(endsWith(_stationURL, "m3u8")) logo = "/common/" + (String) "M3U8" + ".jpg";
        else logo = "/common/" + (String)codecname[_cur_Codec] + ".jpg";
        drawImage(logo.c_str(), 0, _winName.y + 2);
        webSrv.send("stationLogo=", logo);
        goto exit;
    }
    else if(state == DLNA) {
        logo = "/common/DLNA.jpg";
        drawImage(logo.c_str(), 0, _winName.y + 2);
        webSrv.send("stationLogo=", logo);
        goto exit;
    }
    if(state == PLAYER) { // _state PLAYER
        if(_cur_Codec == 0) logo = "/common/AudioPlayer.jpg";
        else if(_playerSubmenue == 0) logo = "/common/AudioPlayer.jpg";
        else logo = "/common/" + (String)codecname[_cur_Codec] + ".jpg";
        drawImage(logo.c_str(), 0, _winName.y + 2);
        goto exit;
    }
exit:
    xSemaphoreGive(mutex_display);
}

void showFileName(const char* fname) {
    if(!fname) return;
    txt_PL_fName.setTextColor(TFT_CYAN);
    txt_PL_fName.writeText(fname, TFT_ALIGN_LEFT, TFT_ALIGN_CENTER);
}

void showPlsFileNumber() {
    tft.setFont(_fonts[3]);
    char buf[15];
    sprintf(buf, "%03u/%03u", _plsCurPos, _PLS_content.size());
    display_info(buf, _winFileNr.x, _winFileNr.y, TFT_ORANGE, 10, 0, _winFileNr.w, _winFileNr.h);
}

void showAudioFileNumber() {
    tft.setFont(_fonts[3]);
    char buf[15];
    sprintf(buf, "%03u/%03u", _cur_AudioFileNr, _SD_content.getSize());
    display_info(buf, _winFileNr.x, _winFileNr.y, TFT_ORANGE, 10, 0, _winFileNr.w, _winFileNr.h);
}

