schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
    if(_f_shuffle) sortPlayListRandom();
    else sortPlayListAlphabetical();

    return true;
}
//____________________________________________________________________________________________________________________________________________________
bool preparePlaylistFromDLNAFolder(){
    vector_clear_and_shrink(_PLS_content); // clear _PLS_content first
    DLNA_Client::srvContent_t foldercontent = dlna.getBrowseResult();
    for ( int i=0; i<foldercontent.size; i++) {
        // log_i( "%d : (%d) %s %s -- %s",i, foldercontent.isAudio[i], foldercontent.itemURL[i], foldercontent.title[i], foldercontent.duration[i]);
        if(!foldercontent.isAudio[i]) continue;
        uint16_t len = strlen((const char*)foldercontent.itemURL[i]) + strlen((const char*)foldercontent.title[i]) + strlen((const char*)foldercontent.duration[i]) + 3;
        // log_i("malloc with size %d %d %d %d",len, strlen((const char*)foldercontent.itemURL[i]), strlen((const char*)foldercontent.title[i]), strlen((const char*)foldercontent.duration[i]));
        char* itstr = x_ps_malloc( len );
        strcpy( itstr, (const char*)foldercontent.itemURL[i]);
        strcat( itstr, "\n");
        strcat( itstr, (const char*)foldercontent.duration[i]);
        strcat( itstr, ",");
        strcat( itstr, (const char*)foldercontent.title[i]);
        log_i("pushing to playlist : %s",itstr);
        _PLS_content.push_back(itstr);
        //_PLS_content.push_back(x_ps_strdup((const char*)foldercontent.itemURL[i]));
    }
    if(!_PLS_content.size()) return false;
    log_i("pls length %i", _PLS_content.size());
    return true;
}
//____________________________________________________________________________________________________________________________________________________

void sortPlayListAlphabetical() {
    for(int i = 0; i < _PLS_content.size(); i++) { // easy bubble sort
        for(int j = 1; j < _PLS_content.size(); j++) {
            if(strcmp(_PLS_content[j - 1], _PLS_content[i]) > 0) { swap(_PLS_content[i], _PLS_content[j - 1]); }
        }
    }
}
//____________________________________________________________________________________________________________________________________________________

void sortPlayListRandom() {
    for(int i = 0; i < _PLS_content.size(); i++) { // easy bubble sort
        uint16_t randIndex = random(0, _PLS_content.size());
        swap(_PLS_content[i], _PLS_content[randIndex]); // swapping the values
    }
}
//____________________________________________________________________________________________________________________________________________________

void processPlaylist(boolean first) {
    if(_PLS_content.size() == 0) {
        log_e("playlist is empty");
        return;
    } // guard
    int16_t idx = 0;
    boolean f_has_EXTINF = false;
    if(first) {
        _plsCurPos = 0;
        _f_playlistEnabled = true;
    }

    if(_plsCurPos == _PLS_content.size()) goto exit;

    _playerSubmenue = 1;
    if(_state != PLAYER) changeState(PLAYER);

    // now read from vector _PLS_content

    idx = indexOf(_PLS_content[_plsCurPos], "\n", 0);
    if(idx > 0) { // has additional infos: duration, title
        f_has_EXTINF = true;
        int16_t idx1 = indexOf(_PLS_content[_plsCurPos], ",", idx);
        SerialPrintfln("Playlist:    " ANSI_ESC_GREEN "Title: %s", _PLS_content[_plsCurPos] + idx1 + 1);
        clearLogo();
        showFileName(_PLS_content[_plsCurPos] + idx1 + 1);
        int8_t len = idx1 - (idx + 1);
        if(len > 0 && len < 6) { // song playtime
            char tmp[7] = {0};
            memcpy(tmp, _PLS_content[_plsCurPos] + idx + 1, len);
            tmp[len] = '\0';
            SerialPrintfln("Playlist:    " ANSI_ESC_GREEN "playtime: %is", atoi(tmp));
        }
        _PLS_content[_plsCurPos][idx] = '\0';
    }
    if(startsWith(_PLS_content[_plsCurPos], "http")) {
        SerialPrintflnCut("Playlist:    ", ANSI_ESC_YELLOW, _PLS_content[_plsCurPos]);
        showVolumeBar();
        if(!f_has_EXTINF) clearLogoAndStationname();
        webSrv.send("SD_playFile=", _PLS_content[_plsCurPos]);
        _cur_Codec = 0;
        connecttohost(_PLS_content[_plsCurPos]);
    }
    else if(startsWith(_PLS_content[_plsCurPos], "file://")) { // root
        urldecode(_PLS_content[_plsCurPos]);
        SerialPrintfln("Playlist:    " ANSI_ESC_YELLOW "%s", _PLS_content[_plsCurPos] + 7);
        webSrv.send("SD_playFile=", _PLS_content[_plsCurPos] + 7);
        SD_playFile(_PLS_content[_plsCurPos] + 7, 0, false);
    }
    else {
        urldecode(_PLS_content[_plsCurPos]);
        char* playFile = NULL;
        if(_playlistPath) { // path of m3u file
            playFile = x_ps_malloc(strlen(_playlistPath) + strlen(_PLS_content[_plsCurPos]) + 5);
            strcpy(playFile, _playlistPath);
            if(_PLS_content[_plsCurPos][0] != '/') strcat(playFile, "/");
            strcat(playFile, _PLS_content[_plsCurPos]);
        }
        else { // have no playlistpath
            playFile = x_ps_malloc(strlen(_PLS_content[_plsCurPos]) + 5);
            strcpy(playFile, _PLS_content[_plsCurPos]);
        }
        SerialPrintfln("Playlist:    " ANSI_ESC_YELLOW "%s", playFile);
        webSrv.send("SD_playFile=", playFile);
        if(f_has_EXTINF) SD_playFile(playFile, 0, false);
        else SD_playFile(playFile, 0, true);
        if(playFile) {
            free(playFile);
            playFile = NULL;
        }
    }
    _plsCurPos++;
    showPlsFileNumber();
    return;

exit:
    SerialPrintfln("Playlist:    " ANSI_ESC_BLUE "end of playlist");
    webSrv.send("SD_playFile=", "end of playlist");
    _f_playlistEnabled = false;
    _playerSubmenue = 0;
    changeState(PLAYER);
    _plsCurPos = 0;
    if(_playlistPath) {
        free(_playlistPath);
        _playlistPath = NULL;
    }
    return;
}
/*****************************************************************************************************************************************************
 *                                         C O N N E C T   TO   W I F I     /     A C C E S S P O I N T                                              *
 *****************************************************************************************************************************************************/
bool connectToWiFi() {

    char* line = x_ps_malloc(512);
    uint16_t idx = 0;
    wifiMulti.addAP(_SSID, _PW);                        // SSID and PW in code
    if(pref.isKey("ap_ssid") && pref.isKey("ap_pw")) {  // exists?
        String ap_ssid = pref.getString("ap_ssid", ""); // credentials from accesspoint
        String ap_pw = pref.getString("ap_pw", "");
        if(ap_ssid.length() > 0 && ap_pw.length() > 0) wifiMulti.addAP(ap_ssid.c_str(), ap_pw.c_str());
    }
    File file = SD_MMC.open("/networks.csv"); // try credentials given in "/networks.txt"
    if(file) {                                // try to read from SD_MMC
        while(file.available()) {
            char emptyStr[1] = "";
            char* s_ssid = emptyStr;
            char* s_password = emptyStr;
            char* s_info = emptyStr;
            idx = file.readBytesUntil('\n', line, 512);     // read the line
            if(idx == 0) break;
            line[idx] = '\0';                               // terminate the line
            if(line[0] == '*') continue;                    // ignore this, goto next line
            if(line[0] == '\n') continue;                   // empty line
            if(line[0] == ' ') continue;                    // space as first char

            uint8_t p = 0;
            uint16_t slen = strlen(line);
            for(int16_t i = 0; i < slen; i++) {
                if(line[i] == '\n') {                       // make LF ineffective
                    line[i] = '\0';
                    continue;
                }
                if(i == 0) s_ssid = line;                   // string at pos 0 is ssid
                if(line[i] == '\t') {
                    line[i] = '\0';
                    if(p == 0) {s_password = line + i + 1;} // string after first tab is passwort (if available)
                    if(p == 1) {    s_info = line + i + 1;} // string after second tab is info (if available)
                    p++;
                }
            }
            if(strlen(s_ssid) == 0) continue;               // ssid is empty
        //    log_i("%s, %s, %s",  s_ssid, s_password, s_info);
            wifiMulti.addAP(s_ssid, s_password);
            (void) s_info; // unused
        }
        file.close();
        if(line){free(line); line = NULL;}
    }
    int16_t n = WiFi.scanNetworks();
    SerialPrintfln("setup: ....  " ANSI_ESC_WHITE "%i WiFi networks found", n);
    for(int i = 0; i < n; i++){
        SerialPrintfln("setup: ....  " ANSI_ESC_GREEN "%s (%d)", WiFi.SSID(i).c_str(), (int16_t)WiFi.RSSI(i));
    }
    wifiMulti.run();
    if(WiFi.isConnected()) {
        SerialPrintfln("WiFI_info:   Connecting WiFi...");
        if(!MDNS.begin("MiniWebRadio")) { SerialPrintfln("WiFI_info:   " ANSI_ESC_YELLOW "Error starting mDNS"); }
        else {
           MDNS.addService("esp32", "tcp", 80);
           SerialPrintfln("WiFI_info:   mDNS name: " ANSI_ESC_CYAN "MiniWebRadio");
        }
        WiFi.setAutoReconnect(true);
        return true;
    }
    else {
        SerialPrintfln("WiFI_info:   " ANSI_ESC_RED "WiFi credentials are not correct");
        return false; // can't connect to any network
    }
}

void openAccessPoint() { // if credentials are not correct open AP at 192.168.4.1
    clearAll();
    tft.setFont(_fonts[4]);
    tft.setTextColor(TFT_YELLOW);
    setTFTbrightness(80);
    _f_accessPoint = true;
    WiFi.mode(WIFI_STA);
    WiFi.disconnect();
    WiFi.softAP("MiniWebRadio");
    IPAddress myIP = WiFi.softAPIP();
    String    AccesspointIP = myIP.toString();
    char      buf[100];
    sprintf(buf, "WiFi credentials are not correct \nAccesspoint IP: " ANSI_ESC_CYAN "%s", AccesspointIP.c_str());
    tft.writeText(buf, 0, 0, _dispWidth, _dispHeight, TFT_ALIGN_LEFT, TFT_ALIGN_CENTER, true, false);
    SerialPrintfln("Accesspoint: " ANSI_ESC_RED "IP: %s", AccesspointIP.c_str());
    int16_t n = WiFi.scanNetworks();
    if(n == 0) {
        SerialPrintfln("setup: ....  no WiFi networks found");
        while(true) { ; }
    }
    else {
        SerialPrintfln("setup: ....  %d WiFi networks found", n);
        for(int32_t i = 0; i < n; ++i) {
            SerialPrintfln("setup: ....  " ANSI_ESC_GREEN "%s (%d)", WiFi.SSID(i).c_str(), (int16_t)WiFi.RSSI(i));
            _scannedNetworks += WiFi.SSID(i) + '\n';
        }
    }
    webSrv.begin(80, 81); // HTTP port, WebSocket port
    return;
}

