schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
void wake_up() {
    _f_sleeping = false;
    SerialPrintfln("awake");
    _f_mute = true;
    muteChanged(false);
    clearAll();
    setTFTbrightness(_brightness);
    if(AMP_ENABLED != -1) {digitalWrite(AMP_ENABLED, HIGH);}
    connecttohost(_lastconnectedhost.c_str());
    _radioSubmenue = 0;
    changeState(RADIO);
    showLogoAndStationName(true);
    dispHeader.show();
    dispFooter.show();
    if(_f_BTpower) BTpowerChanged(true);
}

void setRTC(const char* TZString) {
    rtc.stop();
    _f_rtc = rtc.begin(_TZString.c_str());
    if(!_f_rtc) {
        SerialPrintfln(ANSI_ESC_RED "connection to NTP failed, trying again");
        ESP.restart();
    }
}

boolean copySDtoFFat(const char* path) {
    if(!_f_FFatFound) return false;
    uint8_t buffer[1024];
    size_t  r = 0, w = 0;
    size_t  len = 0;
    File    file1 = SD_MMC.open(path, "r");
    File    file2 = FFat.open(path, "w");
    while(true) {
        r = file1.read(buffer, 1024);
        w = file2.write(buffer, r);
        if(r != w) {
            file1.close();
            file2.close();
            FFat.remove(path);
            return false;
        }
        len += r;
        if(r == 0) break;
    }
    log_i("file length %i, written %i", file1.size(), len);
    if(file1.size() == len) return true;
    return false;
}

void muteChanged(bool m) {
    _f_muteIsPressed = false;
    btn_CL_Mute.setValue(m);
    btn_DL_Mute.setValue(m);
    btn_EQ_Mute.setValue(m);
    btn_PL_Mute.setValue(m);
    btn_RA_Mute.setValue(m);
    if(m) {audioMute(0); _f_mute = true;}
    else {audioMute(_cur_volume); _f_mute = false;}
    if(m) webSrv.send("mute=", "1");
    else webSrv.send("mute=", "0");
    if(_f_mute) dispHeader.setVolumeColor(TFT_RED);
    else        dispHeader.setVolumeColor(TFT_DEEPSKYBLUE);
    dispHeader.updateVolume(_cur_volume);
    updateSettings();
};

void BTpowerChanged(int8_t newState){
    if(BT_EMITTER_CONNECT == -1) return;    // guard
    if(_f_BtEmitterFound == false) return;  // guard

    if(newState){                           // POWER_ON
        digitalWrite(BT_EMITTER_CONNECT, LOW);
        vTaskDelay(100);
        digitalWrite(BT_EMITTER_CONNECT, HIGH);
    }
    else{
        bt_emitter.cmd_PowerOff();          // POWER OFF
    }
    return;
}

void logAlarmItems() {
    const char wd[7][11] = {"Sunday:   ", "Monday:   ", "Tuesday:  ", "Wednesday:", "Thursday: ", "Friday:   ", "Saturday: "};
    uint8_t    mask = 0b00000001;
    for(uint8_t i = 0; i < 7; i++) {
        if(_alarmdays & mask) { SerialPrintfln("AlarmTime:   " ANSI_ESC_YELLOW "%s " ANSI_ESC_CYAN "%02i:%02i", wd[i], _alarmtime[i] / 60, _alarmtime[i] % 60); }
        else { SerialPrintfln("AlarmTime:   " ANSI_ESC_YELLOW "%s No alarm is set", wd[i]); }
        mask <<= 1;
    }
}

void setTimeCounter(uint8_t sec){
    if(sec){
        _timeCounter.timer = 10;
        _timeCounter.factor = sec;
    }
    else{
        _timeCounter.timer = 0;
        _timeCounter.factor = 0;
        dispFooter.updateTC(0);
    }
}


/*         ╔═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╗
           ║                                                                                  M E N U E / B U T T O N S                                                                  ║
           ╚═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╝   */

// clang-format off
void placingGraphicObjects() { // and initialize them
    // ALL STATE
    dispHeader.begin(         _winHeader.x, _winHeader.y, _winHeader.w, _winHeader.h);
    dispFooter.begin(         _winFooter.x, _winFooter.y, _winFooter.w, _winFooter.h);
    // RADIO -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    btn_RA_Mute.begin(    0 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_RA_Mute.setOffPicturePath("/btn/Button_Mute_Green.jpg");
                                                                                         btn_RA_Mute.setOnPicturePath("/btn/Button_Mute_Red.jpg");
                                                                                         btn_RA_Mute.setClickedOffPicturePath("/btn/Button_Mute_Yellow.jpg");
                                                                                         btn_RA_Mute.setClickedOnPicturePath("/btn/Button_Mute_Yellow.jpg");
                                                                                         btn_RA_Mute.setValue(_f_mute);
    btn_RA_volDown.begin( 1 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_RA_volDown.setDefaultPicturePath("/btn/Button_Volume_Down_Blue.jpg");
                                                                                         btn_RA_volDown.setClickedPicturePath("/btn/Button_Volume_Down_Yellow.jpg");
    btn_RA_volUp.begin(   2 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_RA_volUp.setDefaultPicturePath("/btn/Button_Volume_Up_Blue.jpg");
                                                                                         btn_RA_volUp.setClickedPicturePath("/btn/Button_Volume_Up_Yellow.jpg");
    btn_RA_prevSta.begin( 3 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_RA_prevSta.setDefaultPicturePath("/btn/Button_Previous_Green.jpg");
                                                                                         btn_RA_prevSta.setClickedPicturePath("/btn/Button_Previous_Yellow.jpg");
    btn_RA_nextSta.begin( 4 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_RA_nextSta.setDefaultPicturePath("/btn/Button_Next_Green.jpg");
                                                                                         btn_RA_nextSta.setClickedPicturePath("/btn/Button_Next_Yellow.jpg");
    btn_RA_staList.begin( 5 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_RA_staList.setDefaultPicturePath("/btn/Button_List_Green.jpg");
                                                                                         btn_RA_staList.setClickedPicturePath("/btn/Button_List_Yellow.jpg");
    btn_RA_player.begin(  0 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_RA_player.setDefaultPicturePath("/btn/Player_Green.jpg");
                                                                                         btn_RA_player.setClickedPicturePath("/btn/Player_Yellow.jpg");
    btn_RA_dlna.begin(    1 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_RA_dlna.setDefaultPicturePath("/btn/Button_DLNA_Green.jpg");
                                                                                         btn_RA_dlna.setClickedPicturePath("/btn/Button_DLNA_Yellow.jpg");
    btn_RA_clock.begin(   2 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_RA_clock.setDefaultPicturePath("/btn/Clock_Green.jpg");
                                                                                         btn_RA_clock.setClickedPicturePath("/btn/Clock_Yellow.jpg");
    btn_RA_sleep.begin(   3 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_RA_sleep.setDefaultPicturePath("/btn/Button_Sleep_Green.jpg");
                                                                                         btn_RA_sleep.setClickedPicturePath("/btn/Button_Sleep_Yellow.jpg");
    btn_RA_bright.begin(  4 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_RA_bright.setDefaultPicturePath("/btn/Bulb_Green.jpg");
                                                                                         btn_RA_bright.setClickedPicturePath("/btn/Bulb_Yellow.jpg");
                                                                                         btn_RA_bright.setInactivePicturePath("/btn/Bulb_Grey.jpg");
    btn_RA_equal.begin(   5 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_RA_equal.setDefaultPicturePath("/btn/Button_EQ_Green.jpg");
                                                                                         btn_RA_equal.setClickedPicturePath("/btn/Button_EQ_Yellow.jpg");
    btn_RA_bt.begin(      6 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_RA_bt.setDefaultPicturePath("/btn/BT_Green.jpg");
                                                                                         btn_RA_bt.setClickedPicturePath("/btn/BT_Yellow.jpg");
                                                                                         btn_RA_bt.setInactivePicturePath("/btn/BT_Grey.jpg");
    btn_RA_off.begin(     7 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_RA_off.setDefaultPicturePath("/btn/Button_Off_Red.jpg");
                                                                                         btn_RA_off.setClickedPicturePath("/btn/Button_Off_Yellow.jpg");
    txt_RA_sTitle.begin(      _winSTitle.x, _winSTitle.y, _winSTitle.w, _winSTitle.h);   txt_RA_sTitle.setFont(0); // 0 -> auto
    txt_RA_staName.begin(       _winName.x,   _winName.y,   _winName.w,   _winName.h);   txt_RA_staName.setFont(0); // 0 -> auto
    txt_RA_irNum.begin(         _winWoHF.x,   _winWoHF.y,   _winWoHF.w,   _winWoHF.h);   txt_RA_irNum.setTextColor(TFT_GOLD); txt_RA_irNum.setFont(_fonts[8]);
    pic_RA_logo.begin(          _winLogo.x,   _winLogo.y);
    VUmeter_RA.begin(        _winVUmeter.x,_winVUmeter.y,_winVUmeter.w,_winVUmeter.h);
    // STATIONSLIST ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    lst_RADIO.begin(          _winWoHF.x, _winWoHF.y, _winWoHF.w, _winWoHF.h, _fonts[0], &_cur_station, _sum_stations);
    // PLAYER-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    btn_PL_Mute.begin(    0 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_PL_Mute.setOffPicturePath("/btn/Button_Mute_Green.jpg");
                                                                                         btn_PL_Mute.setOnPicturePath("/btn/Button_Mute_Red.jpg");
                                                                                         btn_PL_Mute.setClickedOffPicturePath("/btn/Button_Mute_Yellow.jpg");
                                                                                         btn_PL_Mute.setClickedOnPicturePath("/btn/Button_Mute_Yellow.jpg");
                                                                                         btn_PL_Mute.setValue(_f_mute);
    btn_PL_volDown.begin( 1 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_PL_volDown.setDefaultPicturePath("/btn/Button_Volume_Down_Blue.jpg");
                                                                                         btn_PL_volDown.setClickedPicturePath("/btn/Button_Volume_Down_Yellow.jpg");
    btn_PL_volUp.begin(   2 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_PL_volUp.setDefaultPicturePath("/btn/Button_Volume_Up_Blue.jpg");
                                                                                         btn_PL_volUp.setClickedPicturePath("/btn/Button_Volume_Up_Yellow.jpg");
    btn_PL_pause.begin(   3 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_PL_pause.setOffPicturePath("/btn/Button_Pause_Blue.jpg");
                                                                                         btn_PL_pause.setOnPicturePath("/btn/Button_Right_Blue.jpg");
                                                                                         btn_PL_pause.setClickedOffPicturePath("/btn/Button_Pause_Yellow.jpg");
                                                                                         btn_PL_pause.setClickedOnPicturePath("/btn/Button_Right_Yellow.jpg");
                                                                                         btn_PL_pause.setValue(false);
    btn_PL_cancel.begin(  4 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_PL_cancel.setDefaultPicturePath("/btn/Button_Cancel_Red.jpg");
                                                                                         btn_PL_cancel.setClickedPicturePath("/btn/Button_Cancel_Yellow.jpg");
    btn_PL_prevFile.begin(0 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_PL_prevFile.setDefaultPicturePath("/btn/Button_Left_Blue.jpg");
                                                                                         btn_PL_prevFile.setClickedPicturePath("/btn/Button_Left_Yellow.jpg");
    btn_PL_nextFile.begin(1 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_PL_nextFile.setDefaultPicturePath("/btn/Button_Right_Blue.jpg");
                                                                                         btn_PL_nextFile.setClickedPicturePath("/btn/Button_Right_Yellow.jpg");
    btn_PL_ready.begin(   2 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_PL_ready.setDefaultPicturePath("/btn/Button_Ready_Blue.jpg");
                                                                                         btn_PL_ready.setClickedPicturePath("/btn/Button_Ready_Yellow.jpg");
    btn_PL_playAll.begin( 3 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_PL_playAll.setDefaultPicturePath("/btn/Button_PlayAll_Blue.jpg");
                                                                                         btn_PL_playAll.setClickedPicturePath("/btn/Button_PlayAll_Yellow.jpg");
    btn_PL_shuffle.begin( 4 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_PL_shuffle.setDefaultPicturePath("/btn/Button_Shuffle_Blue.jpg");
                                                                                         btn_PL_shuffle.setClickedPicturePath("/btn/Button_Shuffle_Yellow.jpg");
    btn_PL_fileList.begin(6 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_PL_fileList.setDefaultPicturePath("/btn/Button_List_Green.jpg");
                                                                                         btn_PL_fileList.setClickedPicturePath("/btn/Button_List_Yellow.jpg");
    btn_PL_radio.begin(   7 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_PL_radio.setDefaultPicturePath("/btn/Radio_Green.jpg");
                                                                                         btn_PL_radio.setClickedPicturePath("/btn/Radio_Yellow.jpg");
    txt_PL_fName.begin(         _winName.x,   _winName.y,   _winName.w,   _winName.h);   txt_PL_fName.setFont(0); // 0 -> auto
    // AUDIOFILESLIST-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    lst_PLAYER.begin(         _winWoHF.x, _winWoHF.y, _winWoHF.w, _winWoHF.h, _fonts[0], _curAudioFolder, &_cur_AudioFileNr);
    // DLNA --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    btn_DL_Mute.begin(    0 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_DL_Mute.setOffPicturePath("/btn/Button_Mute_Green.jpg");
                                                                                         btn_DL_Mute.setOnPicturePath("/btn/Button_Mute_Red.jpg");
                                                                                         btn_DL_Mute.setClickedOffPicturePath("/btn/Button_Mute_Yellow.jpg");
                                                                                         btn_DL_Mute.setClickedOnPicturePath("/btn/Button_Mute_Yellow.jpg");
                                                                                         btn_DL_Mute.setValue(_f_mute);
    btn_DL_volDown.begin( 1 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_DL_volDown.setDefaultPicturePath("/btn/Button_Volume_Down_Blue.jpg");
                                                                                         btn_DL_volDown.setClickedPicturePath("/btn/Button_Volume_Down_Yellow.jpg");
    btn_DL_volUp.begin(   2 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_DL_volUp.setDefaultPicturePath("/btn/Button_Volume_Up_Blue.jpg");
                                                                                         btn_DL_volUp.setClickedPicturePath("/btn/Button_Volume_Up_Yellow.jpg");
    btn_DL_pause.begin(   3 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_DL_pause.setOffPicturePath("/btn/Button_Pause_Blue.jpg");
                                                                                         btn_DL_pause.setOnPicturePath("/btn/Button_Right_Blue.jpg");
                                                                                         btn_DL_pause.setClickedOffPicturePath("/btn/Button_Pause_Yellow.jpg");
                                                                                         btn_DL_pause.setClickedOnPicturePath("/btn/Button_Right_Yellow.jpg");
                                                                                         btn_DL_pause.setInactivePicturePath("/btn/Button_Pause_Grey.jpg");
                                                                                         btn_DL_pause.setValue(false);
    btn_DL_cancel.begin(  4 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_DL_cancel.setDefaultPicturePath("/btn/Button_Cancel_Red.jpg");
                                                                                         btn_DL_cancel.setClickedPicturePath("/btn/Button_Cancel_Yellow.jpg");
    btn_DL_fileList.begin(6 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_DL_fileList.setDefaultPicturePath("/btn/Button_List_Green.jpg");
                                                                                         btn_DL_fileList.setClickedPicturePath("/btn/Button_List_Yellow.jpg");
    btn_DL_radio.begin(   7 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_DL_radio.setDefaultPicturePath("/btn/Radio_Green.jpg");
                                                                                         btn_DL_radio.setClickedPicturePath("/btn/Radio_Yellow.jpg");
    txt_DL_fName.begin(         _winName.x,   _winName.y,   _winName.w,   _winName.h);   txt_DL_fName.setFont(0); // 0 -> auto)
    // DLNAITEMSLIST -----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    lst_DLNA.begin(           _winWoHF.x, _winWoHF.y, _winWoHF.w, _winWoHF.h, _fonts[0]);
    // CLOCK -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    clk_CL_green.begin(       _winDigits.x, _winDigits.y, _winDigits.w, _winDigits.h);   clk_CL_green.setTimeFormat(_timeFormat);
    btn_CL_alarm.begin(   0 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_CL_alarm.setDefaultPicturePath("/btn/Bell_Green.jpg");
                                                                                         btn_CL_alarm.setClickedPicturePath("/btn/Bell_Yellow.jpg");
    btn_CL_radio.begin(   1 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_CL_radio.setDefaultPicturePath("/btn/Radio_Green.jpg");
                                                                                         btn_CL_radio.setClickedPicturePath("/btn/Radio_Yellow.jpg");
    btn_CL_Mute.begin(    2 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_CL_Mute.setOffPicturePath("/btn/Button_Mute_Green.jpg");
                                                                                         btn_CL_Mute.setOnPicturePath("/btn/Button_Mute_Red.jpg");
                                                                                         btn_CL_Mute.setClickedOffPicturePath("/btn/Button_Mute_Yellow.jpg");
                                                                                         btn_CL_Mute.setClickedOnPicturePath("/btn/Button_Mute_Yellow.jpg");
                                                                                         btn_CL_Mute.setValue(_f_mute);
    btn_CL_volDown.begin( 3 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_CL_volDown.setDefaultPicturePath("/btn/Button_Volume_Down_Blue.jpg");
                                                                                         btn_CL_volDown.setClickedPicturePath("/btn/Button_Volume_Down_Yellow.jpg");
    btn_CL_volUp.begin(   4 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_CL_volUp.setDefaultPicturePath("/btn/Button_Volume_Up_Blue.jpg");
                                                                                         btn_CL_volUp.setClickedPicturePath("/btn/Button_Volume_Up_Yellow.jpg");
    // ALARM -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    clk_AL_red.begin(          _winAlarm.x, _winAlarm.y, _winAlarm.w, _winAlarm.h);      clk_AL_red.setAlarmTimeAndDays(&_alarmdays, _alarmtime);
    btn_AL_left.begin(    0 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_AL_left.setDefaultPicturePath("/btn/Button_Left_Blue.jpg");
                                                                                         btn_AL_left.setClickedPicturePath("/btn/Button_Left_Yellow.jpg");
    btn_AL_right.begin(   1 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_AL_right.setDefaultPicturePath("/btn/Button_Right_Blue.jpg");
                                                                                         btn_AL_right.setClickedPicturePath("/btn/Button_Right_Yellow.jpg");
    btn_AL_up.begin(      2 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_AL_up.setDefaultPicturePath("/btn/Button_Up_Blue.jpg");
                                                                                         btn_AL_up.setClickedPicturePath("/btn/Button_Up_Yellow.jpg");
    btn_AL_down.begin(    3 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_AL_down.setDefaultPicturePath("/btn/Button_Down_Blue.jpg");
                                                                                         btn_AL_down.setClickedPicturePath("/btn/Button_Down_Yellow.jpg");
    btn_AL_ready.begin(   4 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_AL_ready.setDefaultPicturePath("/btn/Button_Ready_Blue.jpg");
                                                                                         btn_AL_ready.setClickedPicturePath("/btn/Button_Ready_Yellow.jpg");
    // SLEEP -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    btn_SL_up.begin(      0 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_SL_up.setDefaultPicturePath("/btn/Button_Up_Blue.jpg");
                                                                                         btn_SL_up.setClickedPicturePath("/btn/Button_Up_Yellow.jpg");
    btn_SL_down.begin(    1 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_SL_down.setDefaultPicturePath("/btn/Button_Down_Blue.jpg");
