schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
                                                                                         btn_SL_down.setClickedPicturePath("/btn/Button_Down_Yellow.jpg");
    btn_SL_ready.begin(   2 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_SL_ready.setDefaultPicturePath("/btn/Button_Ready_Blue.jpg");
                                                                                         btn_SL_ready.setClickedPicturePath("/btn/Button_Ready_Yellow.jpg");
    btn_SL_cancel.begin(  4 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_SL_cancel.setDefaultPicturePath("/btn/Button_Cancel_Blue.jpg");
                                                                                         btn_SL_cancel.setClickedPicturePath("/btn/Button_Cancel_Yellow.jpg");
    // BRIGHTNESS --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    btn_BR_left.begin(    0 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_BR_left.setDefaultPicturePath("/btn/Button_Left_Blue.jpg");
                                                                                         btn_BR_left.setClickedPicturePath("/btn/Button_Left_Yellow.jpg");
    btn_BR_right.begin(   1 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_BR_right.setDefaultPicturePath("/btn/Button_Right_Blue.jpg");
                                                                                         btn_BR_right.setClickedPicturePath("/btn/Button_Right_Yellow.jpg");
    btn_BR_ready.begin(   2 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_BR_ready.setDefaultPicturePath("/btn/Button_Ready_Blue.jpg");
                                                                                         btn_BR_ready.setClickedPicturePath("/btn/Button_Ready_Yellow.jpg");
    pic_BR_logo.begin(    0,  _winName.y) ;                                              pic_BR_logo.setPicturePath("/common/Brightness.jpg");
    // EQUALIZER ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    sdr_EQ_lowPass.begin(  _sdrLP.x,  _sdrLP.y,  _sdrLP.w,  _sdrLP.h, -40,  6);          sdr_EQ_lowPass.setValue(_toneLP);
    sdr_EQ_bandPass.begin( _sdrBP.x,  _sdrBP.y,  _sdrBP.w,  _sdrBP.h, -40,  6);          sdr_EQ_bandPass.setValue(_toneBP);
    sdr_EQ_highPass.begin( _sdrHP.x,  _sdrHP.y,  _sdrHP.w,  _sdrHP.h, -40,  6);          sdr_EQ_highPass.setValue(_toneHP);
    sdr_EQ_balance.begin( _sdrBAL.x, _sdrBAL.y, _sdrBAL.w, _sdrBAL.h, -16, 16);          sdr_EQ_balance.setValue(_toneBAL);
    txt_EQ_lowPass.begin(  _sdrLP.x +  _sdrLP.w + 2,  _sdrLP.y, 80, _sdrLP.h);           txt_EQ_lowPass.setFont(_fonts[2]);
    txt_EQ_bandPass.begin( _sdrBP.x +  _sdrBP.w + 2,  _sdrBP.y, 80, _sdrBP.h);           txt_EQ_bandPass.setFont(_fonts[2]);
    txt_EQ_highPass.begin( _sdrHP.x +  _sdrHP.w + 2,  _sdrHP.y, 80, _sdrHP.h);           txt_EQ_highPass.setFont(_fonts[2]);
    txt_EQ_balance.begin( _sdrBAL.x + _sdrBAL.w + 2, _sdrBAL.y, 80, _sdrBAL.h);          txt_EQ_balance.setFont(_fonts[2]);
    btn_EQ_lowPass.begin( _sdrLP.x - 60, _sdrLP.y + 1, 48, 48);                          btn_EQ_lowPass.setDefaultPicturePath("/btn/LP_green.jpg");
                                                                                         btn_EQ_lowPass.setClickedPicturePath("/btn/LP_yellow.jpg");
    btn_EQ_bandPass.begin(_sdrBP.x - 60, _sdrBP.y + 1, 48, 48);                          btn_EQ_bandPass.setDefaultPicturePath("/btn/BP_green.jpg");
                                                                                         btn_EQ_bandPass.setClickedPicturePath("/btn/BP_yellow.jpg");
    btn_EQ_highPass.begin(_sdrHP.x - 60, _sdrHP.y + 1, 48, 48);                          btn_EQ_highPass.setDefaultPicturePath("/btn/HP_green.jpg");
                                                                                         btn_EQ_highPass.setClickedPicturePath("/btn/HP_yellow.jpg");
    btn_EQ_balance.begin(_sdrBAL.x - 60, _sdrBAL.y + 1, 48, 48);                         btn_EQ_balance.setDefaultPicturePath("/btn/BAL_green.jpg");
                                                                                         btn_EQ_balance.setClickedPicturePath("/btn/BAL_yellow.jpg");
    btn_EQ_Radio.begin(   0 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_EQ_Radio.setDefaultPicturePath("/btn/Radio_Green.jpg");
                                                                                         btn_EQ_Radio.setClickedPicturePath("/btn/Radio_Yellow.jpg");
    btn_EQ_Player.begin(  1 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_EQ_Player.setDefaultPicturePath("/btn/Player_Green.jpg");
                                                                                         btn_EQ_Player.setClickedPicturePath("/btn/Player_Yellow.jpg");
    btn_EQ_Mute.begin(    2 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_EQ_Mute.setOffPicturePath("/btn/Button_Mute_Green.jpg");
                                                                                         btn_EQ_Mute.setOnPicturePath("/btn/Button_Mute_Red.jpg");
                                                                                         btn_EQ_Mute.setClickedOffPicturePath("/btn/Button_Mute_Yellow.jpg");
                                                                                         btn_EQ_Mute.setClickedOnPicturePath("/btn/Button_Mute_Yellow.jpg");
                                                                                         btn_EQ_Mute.setValue(_f_mute);
    // BLUETOOTH ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    btn_BT_volDown.begin( 0 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_BT_volDown.setDefaultPicturePath("/btn/Button_Volume_Down_Blue.jpg");
                                                                                         btn_BT_volDown.setClickedPicturePath("/btn/Button_Volume_Down_Yellow.jpg");
    btn_BT_volUp.begin(   1 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_BT_volUp.setDefaultPicturePath("/btn/Button_Volume_Up_Blue.jpg");
                                                                                         btn_BT_volUp.setClickedPicturePath("/btn/Button_Volume_Up_Yellow.jpg");
    btn_BT_pause.begin(   2 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_BT_pause.setOffPicturePath("/btn/Button_Pause_Blue.jpg");
                                                                                         btn_BT_pause.setOnPicturePath("/btn/Button_Right_Blue.jpg");
                                                                                         btn_BT_pause.setClickedOffPicturePath("/btn/Button_Pause_Yellow.jpg");
                                                                                         btn_BT_pause.setClickedOnPicturePath("/btn/Button_Right_Yellow.jpg");
    btn_BT_mode.begin(    3 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_BT_mode.setDefaultPicturePath("/btn/Button_RxTx_Blue.jpg");
                                                                                         btn_BT_mode.setClickedPicturePath("/btn/Button_RxTx_Yellow.jpg");
    btn_BT_radio.begin(   4 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_BT_radio.setDefaultPicturePath("/btn/Radio_Green.jpg");
                                                                                         btn_BT_radio.setClickedPicturePath("/btn/Radio_Yellow.jpg");
    btn_BT_power.begin(   5 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_BT_power.setOffPicturePath("/btn/BT_Red.jpg");
                                                                                         btn_BT_power.setOnPicturePath("/btn/BT_Blue.jpg");
                                                                                         btn_BT_power.setClickedOffPicturePath("/btn/BT_Yellow.jpg");
                                                                                         btn_BT_power.setClickedOnPicturePath("/btn/BT_Yellow.jpg");
                                                                                         btn_BT_power.setValue(_f_BTpower);
                                                                                         pic_BT_mode.setPicturePath("/common/BTnc.jpg");
    pic_BT_mode.begin(        _winLogo.x,   _winLogo.y);                                 pic_BT_mode.setAlternativPicturePath("/common/BTnc.jpg");
    txt_BT_volume.begin(      _winFileNr.x, _winFileNr.y, _winFileNr.w, _winFileNr.h);   txt_BT_volume.setFont(_fonts[2]);
    txt_BT_mode.begin(        _winName.x,   _winName.y,   _winName.w,   _winName.h);     txt_BT_mode.setFont(_fonts[5]);
}
// clang-format off

/*         ╔═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╗
           ║                                                                              C H A N G E    S T A T E                                                                       ║
           ╚═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╝   */

// clang-format on
void changeState(int32_t state){
//    log_i("new state %i, current state %i radioSubMenue %i", state, _state, _radioSubmenue);
    switch(_state){
        case RADIO:      btn_RA_Mute.disable();     btn_RA_volDown.disable();  btn_RA_volUp.disable();    btn_RA_prevSta.disable(); btn_RA_nextSta.disable();
                         btn_RA_staList.disable();  btn_RA_player.disable();   btn_RA_dlna.disable();     btn_RA_clock.disable();   btn_RA_sleep.disable();
                         btn_RA_bright.disable();   btn_RA_equal.disable();    pic_RA_logo.disable();     btn_RA_bt.disable();      btn_RA_off.disable();
                         txt_RA_sTitle.disable();   txt_RA_staName.disable();  txt_RA_irNum.disable();    VUmeter_RA.disable(); break;
        case STATIONSLIST:
                         lst_RADIO.disable();
                         break;
        case PLAYER:     btn_PL_Mute.disable();     btn_PL_volDown.disable();  btn_PL_volUp.disable();    btn_PL_pause.disable();   btn_PL_cancel.disable();
                         btn_PL_prevFile.disable(); btn_PL_nextFile.disable(); btn_PL_ready.disable();    btn_PL_playAll.disable(); btn_PL_shuffle.disable();
                         btn_PL_fileList.hide();    btn_PL_radio.hide();       txt_PL_fName.disable();
                         break;
        case AUDIOFILESLIST: lst_PLAYER.disable();
                         break;
        case DLNA:       btn_DL_Mute.disable();     btn_DL_volDown.disable();  btn_DL_volUp.disable();    btn_DL_pause.disable();   btn_DL_cancel.disable();
                         btn_DL_fileList.disable(); btn_DL_radio.disable();    txt_DL_fName.disable();
                         break;
        case DLNAITEMSLIST: lst_DLNA.disable();
                         break;
        case CLOCK:      btn_CL_Mute.disable();     btn_CL_alarm.disable();    btn_CL_radio.disable();    btn_CL_volDown.disable(); btn_CL_volUp.disable();
                         clk_CL_green.disable();
                         break;
        case ALARM:      clk_AL_red.disable();      btn_AL_left.disable();     btn_AL_right.disable();    btn_AL_up.disable();      btn_AL_down.disable();
                         btn_AL_ready.disable();
                         break;
        case SLEEP:      btn_SL_up.disable();       btn_SL_down.disable();     btn_SL_ready.disable();    btn_SL_cancel.disable();
                         break;
        case BRIGHTNESS: btn_BR_left.disable();     btn_BR_right.disable();    btn_BR_ready.disable();    pic_BR_logo.disable();
                         break;
        case EQUALIZER:  sdr_EQ_lowPass.disable();  sdr_EQ_bandPass.disable(); sdr_EQ_highPass.disable(); sdr_EQ_balance.disable();
                         btn_EQ_lowPass.disable();  btn_EQ_bandPass.disable(); btn_EQ_highPass.disable(); btn_EQ_balance.disable(); btn_EQ_Radio.disable();
                         txt_EQ_lowPass.disable();  txt_EQ_bandPass.disable(); txt_EQ_highPass.disable(); txt_EQ_balance.disable(); btn_EQ_Player.disable();
                         btn_EQ_Mute.disable();
                         break;
        case BLUETOOTH:  btn_BT_volDown.disable();  btn_BT_volUp.disable();    btn_BT_pause.disable();    btn_BT_radio.disable();   btn_BT_mode.disable();
                         btn_BT_power.disable(); pic_BT_mode.disable();     txt_BT_volume.disable();   txt_BT_mode.disable();
    }
    _f_volBarVisible = false;
    if(_timeCounter.timer){
        setTimeCounter(0);
    }

    dispHeader.updateItem(_hl_item[state]);
    switch(state) {
        case RADIO:{
            txt_RA_staName.enable();
            pic_RA_logo.enable();
            if(_state != RADIO) clearWithOutHeaderFooter();
            if(_radioSubmenue == 0){
                if(_f_irNumberSeen){txt_RA_irNum.hide(); setStation(_irNumber); _f_irNumberSeen = false;} // ir_number, valid between 1 ... 999
                clearVolBar();
                if(_state != RADIO) {showLogoAndStationName(true);}
                setTimeCounter(0);
                VUmeter_RA.show();
                txt_RA_sTitle.setText("");
                txt_RA_sTitle.show();
                _f_newStreamTitle = true;
            }
            if(_radioSubmenue == 1){ // Mute, Vol+, Vol-, Sta+, Sta-, StaList
                clearTitle();
                showVolumeBar();
                btn_RA_Mute.show();      btn_RA_volDown.show();          btn_RA_volUp.show();
                btn_RA_prevSta.show();   btn_RA_nextSta.show();          btn_RA_staList.show();
            //    txt_RA_staName.show();
                setTimeCounter(2);
            }
            if(_radioSubmenue == 2){ // Player, DLNA, Clock, SleepTime, Brightness, EQ, BT, Off
                clearVolBar();
                btn_RA_player.show();    btn_RA_dlna.show();             btn_RA_clock.show();
                btn_RA_sleep.show();     btn_RA_bright.show(!_f_brightnessIsChangeable); btn_RA_equal.show();
                btn_RA_bt.show(!_f_BtEmitterFound); btn_RA_off.show();
                setTimeCounter(2);
            }
            if(_radioSubmenue == 3){ // show Numbers from IR
                char buf[10];
                itoa(_irNumber, buf, 10);
                txt_RA_irNum.setText(buf, TFT_ALIGN_CENTER, TFT_ALIGN_CENTER);
                txt_RA_irNum.show();
                setTimeCounter(1);
            }
            if(_state != RADIO) webSrv.send("changeState=", "RADIO");
            break;
        }

