schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
        case STATIONSLIST:{
            clearWithOutHeaderFooter();
            lst_RADIO.show();
            setTimeCounter(4);
            break;
        }

        case PLAYER: {
            if(_state != PLAYER) clearWithOutHeaderFooter();
            if(_playerSubmenue == 0){
                _SD_content.listDir(_curAudioFolder, true, true);
                _cur_Codec = 0;
                showFileLogo(PLAYER);
                showFileName(_SD_content.getIndex(_cur_AudioFileNr));
           //     showAudioFileNumber();
                if(_state != PLAYER) webSrv.send("changeState=", "PLAYER");
                showAudioFileNumber();
                txt_PL_fName.show();
                btn_PL_prevFile.show(); btn_PL_nextFile.show(); btn_PL_ready.show(); btn_PL_playAll.show(); btn_PL_shuffle.show(); btn_PL_fileList.show(); btn_PL_radio.show();
            }
            if(_playerSubmenue == 1){
                txt_PL_fName.setText("");
                btn_PL_Mute.show(); btn_PL_volDown.show(); btn_PL_volUp.show(); btn_PL_pause.setOff(); btn_PL_pause.show(); btn_PL_cancel.show(); txt_PL_fName.show();
            }
            break;
        }
        case AUDIOFILESLIST: {
            clearWithOutHeaderFooter();
            lst_PLAYER.show();
            setTimeCounter(4);
            break;
        }
        case DLNA:{
            clearWithOutHeaderFooter();
            showFileLogo(state);
            showVolumeBar();
            btn_DL_Mute.show();    btn_DL_volDown.show();  btn_DL_volUp.show();    btn_DL_pause.show();   btn_DL_cancel.show(); btn_DL_fileList.show(); btn_DL_radio.show();
            txt_DL_fName.show();
            break;
        }
        case DLNAITEMSLIST:{
            lst_DLNA.show(_currDLNAsrvNr, dlna.getServer(), dlna.getBrowseResult(), &_dlnaLevel, _dlnaMaxItems);
            setTimeCounter(4);
            break;
        }
        case CLOCK:{
            if(_clockSubMenue == 0){
                setTimeCounter(0);
                if(_state != CLOCK){
                    clearWithOutHeaderFooter();
                    clk_CL_green.updateTime(rtc.getMinuteOfTheDay(), rtc.getweekday());
                }
                else{
                    btn_CL_Mute.hide();     btn_CL_alarm.hide();    btn_CL_radio.hide();    btn_CL_volDown.hide(); btn_CL_volUp.hide();
                    clearVolBar();
                }
                clk_CL_green.show();
            }
            if(_clockSubMenue == 1){
                btn_CL_Mute.show();     btn_CL_alarm.show();    btn_CL_radio.show();    btn_CL_volDown.show(); btn_CL_volUp.show();
                setTimeCounter(2);
            }
            break;
        }
        case ALARM:{
            clearWithOutHeaderFooter();
            clk_AL_red.show();          btn_AL_left.show();     btn_AL_right.show();    btn_AL_up.show();      btn_AL_down.show();
            btn_AL_ready.show();
            break;
        }
        case SLEEP:{
            clearWithOutHeaderFooter();
            display_sleeptime();
            btn_SL_up.show();           btn_SL_down.show();       btn_SL_ready.show();    btn_SL_cancel.show();
            if(TFT_CONTROLLER < 2) drawImage("/common/Night_Gown.bmp", 198, 23);
            else                   drawImage("/common/Night_Gown.bmp", 280, 45);
            break;
        }
        case BRIGHTNESS:{
            clearWithOutHeaderFooter();
            btn_BR_left.show(); btn_BR_right.show(); btn_BR_ready.show(); pic_BR_logo.show();
            showBrightnessBar();
            break;
        }
        case EQUALIZER:
            if(_state != EQUALIZER) clearWithOutHeaderFooter();
            sdr_EQ_lowPass.show(); sdr_EQ_bandPass.show(); sdr_EQ_highPass.show(); sdr_EQ_balance.show();
            btn_EQ_lowPass.show(); btn_EQ_bandPass.show(); btn_EQ_highPass.show(); btn_EQ_balance.show(); btn_EQ_Radio.show(); btn_EQ_Player.show(); btn_EQ_Mute.show();
            txt_EQ_lowPass.show(); txt_EQ_bandPass.show(); txt_EQ_highPass.show(); txt_EQ_balance.show();
            break;

        case BLUETOOTH:
            clearWithOutHeaderFooter();
            btn_BT_volUp.show(); btn_BT_volDown.show(); btn_BT_pause.show(); btn_BT_mode.show(); btn_BT_radio.show(); btn_BT_power.show(); pic_BT_mode.show();
            char* mode = strdup(bt_emitter.getMode());
            if(strcmp(mode, "RX") == 0){
                txt_BT_mode.writeText("RECEIVER", TFT_ALIGN_CENTER, TFT_ALIGN_CENTER);
                if(bt_emitter.isConnected()) muteChanged(true);
            }
            else {
                txt_BT_mode.writeText("EMITTER", TFT_ALIGN_CENTER, TFT_ALIGN_CENTER);
            }
            txt_BT_mode.setBGcolor(TFT_BROWN); txt_BT_mode.show();
            char c[10]; sprintf(c, "Vol: %02i", bt_emitter.getVolume()); txt_BT_volume.writeText(c, TFT_ALIGN_CENTER, TFT_ALIGN_CENTER); txt_BT_volume.show();
            if(_state != BLUETOOTH) webSrv.send("changeState=", "BLUETOOTH");
            if(mode){ free(mode); mode = NULL;}
            break;
    }
    _state = state;
}
// clang-format on

/*         ╔═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╗
           ║                                                                                    L O O P                                                                                  ║
           ╚═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╝   */

void loop() {
    if(!_f_ESPfound) return;    // Guard:  wrong chip?
    if(!_f_SD_MMCfound) return; // Guard:  SD_MMC could not be initialisized
    webSrv.loop();
    ir.loop();
    tp.loop();
    ftpSrv.handleFTP();
    ArduinoOTA.handle();
    dlna.loop();
    bt_emitter.loop();

    if(_f_dlnaBrowseServer) {_f_dlnaBrowseServer = false; dlna.browseServer(_currDLNAsrvNr, _dlnaHistory[_dlnaLevel].objId, _totalNumberReturned);}
    if(_f_clearLogo)        {_f_clearLogo = false; clearLogo();}
    if(_f_clearStationName) { _f_clearStationName = false; clearStationName();}

    if(_f_playlistEnabled) {
        if(!_f_playlistNextFile) {
            if(!audioIsRunning() && !_f_pauseResume) {
                SerialPrintfln("AUDIO_info:  " ANSI_ESC_GREEN "next playlist file");
                processPlaylist(false);
                _playlistTime = millis();
                _f_playlistNextFile = true;
            }
        }
        else {
            if(_playlistTime + 5000 < millis()) _f_playlistNextFile = false;
        }
    }
    //-----------------------------------------------------0.1 SEC------------------------------------------------------------------------------------
    if(_f_100ms) { // calls every 0.1 second
        _f_100ms = false;

        if(_state == RADIO && _radioSubmenue == 0) VUmeter_RA.update(audioGetVUlevel());

        static uint8_t factor = 0;
        static bool f_tc = false;
        if(factor > 0){
            factor --;
        }
        else{
            if(_timeCounter.timer > 0){
                factor = _timeCounter.factor;
                dispFooter.updateTC(_timeCounter.timer);
                _timeCounter.timer --;
                f_tc = true;
            }
            else{
                if(f_tc){
                    f_tc = false;
                    dispFooter.updateTC(0);
                    if(_f_sleeping) return; // tc is active by pressing a button, but do nothing if "off"
                    if(_state == RADIO) {
                        _radioSubmenue = 0;
                        changeState(RADIO);
                    }
                    else if(_state == CLOCK) {
                        _clockSubMenue = 0;
                        changeState(CLOCK);
                    }
                    //    else if(_state == RADIO && _f_switchToClock) { changeState(CLOCK); _f_switchToClock = false; }
                    else if(_state == STATIONSLIST) { changeState(RADIO); }
                    else if(_state == AUDIOFILESLIST) { _playerSubmenue = 0; changeState(PLAYER); }
                    else if(_state == DLNAITEMSLIST) { changeState(DLNA); }
                    else { ; } // all other, do nothing
                }
            }

