schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
        }
    }
    //-----------------------------------------------------1 SEC--------------------------------------------------------------------------------------

    if(_f_1sec) { // calls every second
        _f_1sec = false;
        const char* time_s = rtc.gettime_s();
        clk_CL_green.updateTime(rtc.getMinuteOfTheDay(), rtc.getweekday());

        //------------------------------------------ALARM MANAGEMENT----------------------------------------------------------------------------------
        {
            if(!_semaphore) { _f_alarm = clk_CL_green.isAlarm(_alarmdays, _alarmtime); }
            if(_f_alarm)         {_semaphore++;}
            if(_semaphore)       {_semaphore++;}
            if(_semaphore >= 65) { _semaphore = 0;}
            if(_f_alarm) {
                _f_alarm = false;
                clearAll();
                dispHeader.updateItem("ALARM");
                dispHeader.updateTime(rtc.gettime_s());
                dispFooter.show();
                if(_alarmMode == 1){ // alarm with bell
                    showFileName("ALARM");
                    drawImage("/common/Alarm.jpg", _winLogo.x, _winLogo.y);
                    setTFTbrightness(_brightness);
                    SerialPrintfln(ANSI_ESC_MAGENTA "Alarm");
                    if(AMP_ENABLED != -1) {digitalWrite(AMP_ENABLED, HIGH);}
                    audioSetVolume(21);
                    muteChanged(false);
                    connecttoFS("/ring/alarm_clock.mp3");
                }
                else{ // alarm without bell
                    _f_eof_alarm = true;
                    return;
                }
            }
            if(_f_eof_alarm) { // AFTER RINGING
                _f_eof_alarm = false;
                audioSetVolume(_cur_volume);
                dispHeader.updateVolume(_cur_volume);
                wake_up();
            }
        }
        //------------------------------------------1SEC ROUTINE--------------------------------------------------------------------------------------
        if(!_f_sleeping) {
            dispHeader.updateTime(rtc.gettime_s(), false);
            dispFooter.updateRSSI(WiFi.RSSI());

            if(_f_newBitRate) {
               _f_newBitRate = false;
               dispFooter.updateBitRate(_icyBitRate);
            }
            if(_f_newStationName) {
                _f_newStationName = false;
                showLogoAndStationName(false);
            }
        }
        //---------------------------------------------TIME SPEECH -----------------------------------------------------------------------------------
        if((_f_mute == false) && (!_f_sleeping)) {
            static bool f_resume = false;
            if(endsWith(time_s, "59:53") && _state == RADIO) { // speech the time 7 sec before a new hour is arrived
                int hour = atoi(time_s);                       //  extract the hour
                hour++;
                if(hour == 24) hour = 0;
                if(_f_timeAnnouncement) {
                    f_resume = true;
                    _f_eof = false;
                    if(_timeFormat == 12)
                        if(hour > 12) hour -= 12;
                    sprintf(_chbuf, "/voice_time/%d_00.mp3", hour);
                    SerialPrintfln("Time: ...... play Audiofile %s", _chbuf) connecttoFS(_chbuf);
                    return;
                }
                else { SerialPrintfln("Time: ...... Announcement at %d o'clock is silent", hour); }
            }
            if(f_resume && _f_eof){
                f_resume = false;
                _f_eof = false;
                connecttohost(_lastconnectedhost.c_str());
            }
        }
        //------------------------------------------HEADPHONE / LOUDSPEAKER --------------------------------------------------------------------------
        if(_f_hpChanged) {
            setVolume(_cur_volume);
            if(!digitalRead(HP_DETECT)) { SerialPrintfln("Headphone plugged in"); }
            else { SerialPrintfln("Headphone unplugged"); }
            _f_hpChanged = false;
        }
        //------------------------------------------AUDIO_CURRENT_TIME - DURATION---------------------------------------------------------------------
        if(audioIsRunning() && _f_isFSConnected) {
            _audioCurrentTime = audioGetCurrentTime();
            _audioFileDuration = audioGetFileDuration();
            if(_audioFileDuration) {
                SerialPrintfcr("AUDIO_FILE:  " ANSI_ESC_GREEN "AudioCurrentTime " ANSI_ESC_GREEN "%li:%02lis, " ANSI_ESC_GREEN "AudioFileDuration " ANSI_ESC_GREEN "%li:%02lis",
                               (long int)_audioCurrentTime / 60, (long int)_audioCurrentTime % 60, (long int)_audioFileDuration / 60, (long int)_audioFileDuration % 60);
            }
        }
        //------------------------------------------NEW STREAMTITLE-----------------------------------------------------------------------------------
        if(_f_newStreamTitle && !_timeCounter.timer) {
            _f_newStreamTitle = false;
            if(_state == RADIO) {
                if(strlen(_streamTitle)) showStreamTitle(_streamTitle);
                else if(strlen(_icyDescription)) {
                    showStreamTitle(_icyDescription);
                    _f_newIcyDescription = false;
                    webSrv.send("icy_description=", _icyDescription);
                }
                else txt_RA_sTitle.writeText("");
            }
            webSrv.send("streamtitle=", _streamTitle);
        }
        //------------------------------------------NEW ICY-DESCRIPTION-------------------------------------------------------------------------------
        if(_f_newIcyDescription && !_timeCounter.timer) {
            if(_state == RADIO) {
                if(!strlen(_streamTitle)) showStreamTitle(_icyDescription);
            }
            webSrv.send("icy_description=", _icyDescription);
            _f_newIcyDescription = false;
        }
        //------------------------------------------NEW COMMERCIALS-----------------------------------------------------------------------------------
        if(_f_newCommercial && !_timeCounter.timer) {
            if(_state == RADIO) { showStreamTitle(_commercial); }
            webSrv.send("streamtitle=", _commercial);
            _f_newCommercial = false;
        }
        //------------------------------------------END OF COMMERCIALS--------------------------------------------------------------------------------
        if(_commercial_dur > 0) {
            _commercial_dur--;
            if((_commercial_dur == 2) && (_state == RADIO)) clearStreamTitle(); // end of commercial? clear streamtitle
        }
        //------------------------------------------DETERMINE AUDIOCODEC------------------------------------------------------------------------------
        if(_cur_Codec == 0) {
            uint8_t c = audioGetCodec();
            if(c != 0 && c != 8 && c < 10) { // unknown or OGG, guard: c {1 ... 7, 9}
                _cur_Codec = c;
                SerialPrintfln("Audiocodec:  " ANSI_ESC_YELLOW "%s", codecname[c]);
                if(_state == PLAYER) showFileLogo(PLAYER);
                if(_state == RADIO && _f_logoUnknown == true) {
                    _f_logoUnknown = false;
                    showFileLogo(_state);
                }
            }
        }
        //------------------------------------------CONNECT TO LASTHOST-------------------------------------------------------------------------------
        if(_f_connectToLasthost){
            _f_connectToLasthost = false;
            connecttohost(_lastconnectedhost.c_str());
        }
        //------------------------------------------RECONNECT AFTER FAIL------------------------------------------------------------------------------
        if(_f_reconnect){
            _f_reconnect = false;
            _reconnectCnt ++;
            if(_reconnectCnt < 3){
                SerialPrintfln("RECONNECTION " ANSI_ESC_RED "to %s, try %i", _lastconnectedhost.c_str(), _reconnectCnt);
                connectToWiFi();
                connecttohost(_lastconnectedhost.c_str());
                if(audioIsRunning()) _reconnectCnt = 0;
            }
        }
        //------------------------------------------SEEK DLNA SERVER----------------------------------------------------------------------------------
        if(_f_dlnaSeekServer) {
            _f_dlnaSeekServer = false;
            dlna.seekServer();
        }
        //------------------------------------------CREATE DLNA PLAYLIST------------------------------------------------------------------------------
        if(_f_dlnaMakePlaylistOTF && _f_dlna_browseReady){
            _f_dlnaMakePlaylistOTF = false;
            _f_dlna_browseReady = false;
            if(preparePlaylistFromDLNAFolder()) processPlaylist(true);
        }
        //------------------------------------------DLNA ITEMS RECEIVED-------------------------------------------------------------------------------
        if(_f_dlna_browseReady){ // unused
            _f_dlna_browseReady = false;
        }
        //-------------------------------------------WIFI DISCONNECTED?-------------------------------------------------------------------------------
        if((WiFi.status() != WL_CONNECTED)) {
            _WiFi_disconnectCnt ++;
            if(_WiFi_disconnectCnt == 15){
                _WiFi_disconnectCnt = 1;
                SerialPrintfln("WiFi         :  " ANSI_ESC_YELLOW "Reconnecting to WiFi...");
                WiFi.disconnect();
                WiFi.reconnect();
            }
        }
        else{
            if(_WiFi_disconnectCnt){
                _WiFi_disconnectCnt = 0;
                if(_state == RADIO) audioConnecttohost(_lastconnectedhost.c_str());
            }
        }
        //------------------------------------------GET AUDIO FILE ITEMS------------------------------------------------------------------------------
        if(_f_isFSConnected) {
            //    uint32_t t = 0;
            //    uint32_t fs = audioGetFileSize();
            //    uint32_t br = audioGetBitRate();
            //    if(br) t = (fs * 8)/ br;
            //    log_w("Br %d, Dur %ds", br, t);
        }
    } //  END _f_1sec


    if(_f_10sec == true) { // calls every 10 seconds
        _f_10sec = false;
        if(_state == RADIO && !_icyBitRate && !_f_sleeping) {
            _decoderBitRate = audioGetBitRate();
            static uint32_t oldBr = 0;
            if(_decoderBitRate != oldBr){
                oldBr = _decoderBitRate;
                dispFooter.updateBitRate(_decoderBitRate / 1000);
            }
        }
        updateSettings();
    }

    if(_f_1min == true) {  // calls every minute
        _f_1min = false;
        if(_sleeptime){
            _sleeptime--;
            if(!_sleeptime) fall_asleep();
            dispFooter.updateOffTime(_sleeptime);
        }
    }

